app/Controllers/Metricas.php

        }

        // KPIs del período filtrado
        $kpi = $db->table('ventas')
            ->select('COUNT(*) AS cantidad_ventas, COALESCE(SUM(total),0) AS total_facturado, COALESCE(AVG(total),0) AS ticket_promedio')
            ->where('fecha_venta >=', $desde)
            ->where('fecha_venta <=', $hasta)
            ->get()
            ->getRowArray();

        // Ventas por vendedor
        $ventasPorVendedor = $db->table('ventas')
            ->select('usuarios.id, usuarios.nombre, COUNT(ventas.id) AS cantidad_ventas, COALESCE(SUM(ventas.total),0) AS total_vendido, COALESCE(AVG(ventas.total),0) AS ticket_promedio')
            ->join('usuarios', 'usuarios.id = ventas.usuario_id')
            ->where('ventas.fecha_venta >=', $desde)
            ->where('ventas.fecha_venta <=', $hasta)
            ->groupBy('usuarios.id, usuarios.nombre')
            ->orderBy('total_vendido', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT COUNT(*) AS cantidad_ventas, COALESCE(SUM(total), 0) AS total_facturado, COALESCE(AVG(total), 0) AS ticket_promedio
FROM `ventas`
WHERE `fecha_venta` >= '2026-04-01'
AND `fecha_venta` <= '2026-04-30'
SELECT `usuarios`.`id`, `usuarios`.`nombre`, COUNT(ventas.id) AS cantidad_ventas, COALESCE(SUM(ventas.total), 0) AS total_vendido, COALESCE(AVG(ventas.total), 0) AS ticket_promedio
FROM `ventas`
JOIN `usuarios` ON `usuarios`.`id` = `ventas`.`usuario_id`
WHERE `ventas`.`fecha_venta` >= '2026-04-01'
AND `ventas`.`fecha_venta` <= '2026-04-30'
GROUP BY `usuarios`.`id`, `usuarios`.`nombre`
ORDER BY `total_vendido` DESC

        $topVendedor = !empty($ventasPorVendedor) ? $ventasPorVendedor[0] : null;

        // Ventas por molino
        $ventasPorMolino = $db->table('venta_detalles')
            ->select('productos.molino,
                      COALESCE(SUM(venta_detalles.cantidad),0) AS bolsas_vendidas,
                      COALESCE(SUM(venta_detalles.subtotal),0) AS total_vendido,
                      COUNT(DISTINCT venta_detalles.venta_id) AS cantidad_ventas')
            ->join('productos', 'productos.id = venta_detalles.producto_id')
            ->join('ventas', 'ventas.id = venta_detalles.venta_id')
            ->where('productos.molino IS NOT NULL')
            ->where('productos.molino !=', '')
            ->where('ventas.fecha_venta >=', $desde)
            ->where('ventas.fecha_venta <=', $hasta)
            ->groupBy('productos.molino')
            ->orderBy('total_vendido', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `productos`.`molino`, COALESCE(SUM(venta_detalles.cantidad), 0) AS bolsas_vendidas, COALESCE(SUM(venta_detalles.subtotal), 0) AS total_vendido, COUNT(DISTINCT venta_detalles.venta_id) AS cantidad_ventas
FROM `venta_detalles`
JOIN `productos` ON `productos`.`id` = `venta_detalles`.`producto_id`
JOIN `ventas` ON `ventas`.`id` = `venta_detalles`.`venta_id`
WHERE `productos`.`molino` IS NOT NULL
AND `productos`.`molino` != ''
AND `ventas`.`fecha_venta` >= '2026-04-01'
AND `ventas`.`fecha_venta` <= '2026-04-30'
GROUP BY `productos`.`molino`
ORDER BY `total_vendido` DESC

        $topMolino = !empty($ventasPorMolino) ? $ventasPorMolino[0] : null;

        // Histórico por vendedor
        $ventasPorVendedorHistorico = $db->table('ventas')
            ->select('usuarios.id, usuarios.nombre, COUNT(ventas.id) AS cantidad_ventas, COALESCE(SUM(ventas.total),0) AS total_vendido')
            ->join('usuarios', 'usuarios.id = ventas.usuario_id')
            ->groupBy('usuarios.id, usuarios.nombre')
            ->orderBy('total_vendido', 'DESC')
            ->get()
            ->getResultArray();

        // Top productos por cantidad
        $topProductosCantidad = $db->table('venta_detalles')
            ->select('productos.id,
                      productos.nombre,
                      productos.molino,
                      productos.stock_unidades,
                      productos.stock_minimo,
                      categorias.nombre AS categoria_nombre,
                      COALESCE(SUM(venta_detalles.cantidad),0) AS bolsas_vendidas,
                      COUNT(DISTINCT venta_detalles.venta_id) AS cantidad_ventas,
                      COALESCE(SUM(venta_detalles.subtotal),0) AS total_vendido')
            ->join('productos', 'productos.id = venta_detalles.producto_id')
            ->join('categorias', 'categorias.id = productos.categoria_id', 'left')
            ->join('ventas', 'ventas.id = venta_detalles.venta_id')
            ->where('ventas.fecha_venta >=', $desde)
            ->where('ventas.fecha_venta <=', $hasta)
            ->groupBy('productos.id, productos.nombre, productos.molino, productos.stock_unidades, productos.stock_minimo, categorias.nombre')
            ->orderBy('bolsas_vendidas', 'DESC')
            ->limit(10)
            ->get()
            ->getResultArray();

        // Top productos por facturación
        $topProductosFacturacion = $db->table('venta_detalles')
            ->select('productos.id,
                      productos.nombre,
                      productos.molino,
                      productos.stock_unidades,
                      productos.stock_minimo,
                      categorias.nombre AS categoria_nombre,
                      COALESCE(SUM(venta_detalles.subtotal),0) AS total_vendido,
                      COALESCE(SUM(venta_detalles.cantidad),0) AS bolsas_vendidas,
                      COUNT(DISTINCT venta_detalles.venta_id) AS cantidad_ventas')
            ->join('productos', 'productos.id = venta_detalles.producto_id')
            ->join('categorias', 'categorias.id = productos.categoria_id', 'left')
            ->join('ventas', 'ventas.id = venta_detalles.venta_id')
            ->where('ventas.fecha_venta >=', $desde)
            ->where('ventas.fecha_venta <=', $hasta)
            ->groupBy('productos.id, productos.nombre, productos.molino, productos.stock_unidades, productos.stock_minimo, categorias.nombre')
            ->orderBy('total_vendido', 'DESC')
            ->limit(10)
            ->get()
            ->getResultArray();
---
SELECT `usuarios`.`id`, `usuarios`.`nombre`, COUNT(ventas.id) AS cantidad_ventas, COALESCE(SUM(ventas.total), 0) AS total_vendido
FROM `ventas`
JOIN `usuarios` ON `usuarios`.`id` = `ventas`.`usuario_id`
GROUP BY `usuarios`.`id`, `usuarios`.`nombre`
ORDER BY `total_vendido` DESC
SELECT `productos`.`id`, `productos`.`nombre`, `productos`.`molino`, `productos`.`stock_unidades`, `productos`.`stock_minimo`, `categorias`.`nombre` AS `categoria_nombre`, COALESCE(SUM(venta_detalles.cantidad), 0) AS bolsas_vendidas, COUNT(DISTINCT venta_detalles.venta_id) AS cantidad_ventas, COALESCE(SUM(venta_detalles.subtotal), 0) AS total_vendido
FROM `venta_detalles`
JOIN `productos` ON `productos`.`id` = `venta_detalles`.`producto_id`
LEFT JOIN `categorias` ON `categorias`.`id` = `productos`.`categoria_id`
JOIN `ventas` ON `ventas`.`id` = `venta_detalles`.`venta_id`
WHERE `ventas`.`fecha_venta` >= '2026-04-01'
AND `ventas`.`fecha_venta` <= '2026-04-30'
GROUP BY `productos`.`id`, `productos`.`nombre`, `productos`.`molino`, `productos`.`stock_unidades`, `productos`.`stock_minimo`, `categorias`.`nombre`
ORDER BY `bolsas_vendidas` DESC
 LIMIT 10
SELECT `productos`.`id`, `productos`.`nombre`, `productos`.`molino`, `productos`.`stock_unidades`, `productos`.`stock_minimo`, `categorias`.`nombre` AS `categoria_nombre`, COALESCE(SUM(venta_detalles.subtotal), 0) AS total_vendido, COALESCE(SUM(venta_detalles.cantidad), 0) AS bolsas_vendidas, COUNT(DISTINCT venta_detalles.venta_id) AS cantidad_ventas
FROM `venta_detalles`
JOIN `productos` ON `productos`.`id` = `venta_detalles`.`producto_id`
LEFT JOIN `categorias` ON `categorias`.`id` = `productos`.`categoria_id`
JOIN `ventas` ON `ventas`.`id` = `venta_detalles`.`venta_id`
WHERE `ventas`.`fecha_venta` >= '2026-04-01'
AND `ventas`.`fecha_venta` <= '2026-04-30'
GROUP BY `productos`.`id`, `productos`.`nombre`, `productos`.`molino`, `productos`.`stock_unidades`, `productos`.`stock_minimo`, `categorias`.`nombre`
ORDER BY `total_vendido` DESC
 LIMIT 10