app/Controllers/Pedidos.php

SELECT `id`, `nombre`
FROM `usuarios`
WHERE `rol` = 'vendedor'
ORDER BY `nombre` ASC
---
    $vendedores = [];
    if ($rol === 'admin') {
        $db = \Config\Database::connect();
        $vendedores = $db->table('usuarios')
            ->select('id, nombre')
            ->where('rol', 'vendedor')
            ->orderBy('nombre', 'ASC')
            ->get()
            ->getResultArray();

SELECT *
FROM `clientes`
ORDER BY `nombre` ASC
SELECT `productos`.*, `categorias`.`nombre` AS `categoria_nombre`
FROM `productos`
JOIN `categorias` ON `categorias`.`id` = `productos`.`categoria_id`
ORDER BY `productos`.`nombre` ASC
---
    public function create()
    {
        $clienteModel = new ClienteModel();
        $productoModel = new ProductoModel();

        $clientes = $clienteModel
            ->orderBy('nombre', 'ASC')
            ->findAll();

        $productos = $productoModel
            ->select('productos.*, categorias.nombre AS categoria_nombre')
            ->join('categorias', 'categorias.id = productos.categoria_id')
            ->orderBy('productos.nombre', 'ASC')
            ->findAll();

SELECT *
FROM `pedidos`
WHERE `pedidos`.`id` = '1'
---
    public function cambiarEstado($id = null)
    {
        $pedidoModel = new PedidoModel();
        $pedido = $pedidoModel->find($id);

UPDATE `pedidos` SET `estado` = 'cancelado'
WHERE `pedidos`.`id` IN ('1')
---
            return redirect()->to('/pedidos')->with('success', 'Pedido entregado, venta generada y stock descontado correctamente.');
        }

        $pedidoModel->update($id, [
            'estado' => $nuevoEstado,
        ]);

SELECT `pedidos`.*, `clientes`.`nombre` AS `cliente_nombre`, `clientes`.`telefono`, `clientes`.`direccion`, `clientes`.`localidad`, `usuarios`.`nombre` AS `vendedor_nombre`
FROM `pedidos`
JOIN `clientes` ON `clientes`.`id` = `pedidos`.`cliente_id`
JOIN `usuarios` ON `usuarios`.`id` = `pedidos`.`usuario_id`
WHERE `pedidos`.`id` = '4'
 LIMIT 1
SELECT `pedido_detalles`.*, `productos`.`nombre` AS `producto_nombre`, `productos`.`kilogramos`, `categorias`.`nombre` AS `categoria_nombre`
FROM `pedido_detalles`
JOIN `productos` ON `productos`.`id` = `pedido_detalles`.`producto_id`
JOIN `categorias` ON `categorias`.`id` = `productos`.`categoria_id`
WHERE `pedido_detalles`.`pedido_id` = '4'
---
    public function show($id = null)
{
    $pedidoModel = new PedidoModel();
    $pedidoDetalleModel = new PedidoDetalleModel();

    $pedido = $pedidoModel
        ->select('pedidos.*, clientes.nombre AS cliente_nombre, clientes.telefono, clientes.direccion, clientes.localidad, usuarios.nombre AS vendedor_nombre')
        ->join('clientes', 'clientes.id = pedidos.cliente_id')
        ->join('usuarios', 'usuarios.id = pedidos.usuario_id')
        ->where('pedidos.id', $id)
        ->first();

    if (!$pedido) {
        return redirect()->to('/pedidos')->with('error', 'El pedido no existe.');
    }

    if (session('rol') === 'vendedor' && (int) $pedido['usuario_id'] !== (int) session('id_usuario')) {
        return redirect()->to('/pedidos')->with('error', 'No tienes permisos para ver este pedido.');
    }

    $detalles = $pedidoDetalleModel
        ->select('pedido_detalles.*, productos.nombre AS producto_nombre, productos.kilogramos, categorias.nombre AS categoria_nombre')
        ->join('productos', 'productos.id = pedido_detalles.producto_id')
        ->join('categorias', 'categorias.id = productos.categoria_id')
        ->where('pedido_detalles.pedido_id', $id)
        ->findAll();

SELECT `pedidos`.*, `clientes`.`nombre` AS `cliente_nombre`, `clientes`.`telefono`, `clientes`.`direccion`, `clientes`.`localidad`, `usuarios`.`nombre` AS `vendedor_nombre`
FROM `pedidos`
JOIN `clientes` ON `clientes`.`id` = `pedidos`.`cliente_id`
JOIN `usuarios` ON `usuarios`.`id` = `pedidos`.`usuario_id`
WHERE `pedidos`.`id` = '3'
 LIMIT 1
SELECT `pedido_detalles`.*, `productos`.`nombre` AS `producto_nombre`, `productos`.`kilogramos`, `categorias`.`nombre` AS `categoria_nombre`
FROM `pedido_detalles`
JOIN `productos` ON `productos`.`id` = `pedido_detalles`.`producto_id`
JOIN `categorias` ON `categorias`.`id` = `productos`.`categoria_id`
WHERE `pedido_detalles`.`pedido_id` = '3'
---
public function pdf($id = null)
{
    ini_set('memory_limit', '1024M');

    $pedidoModel = new PedidoModel();
    $pedidoDetalleModel = new PedidoDetalleModel();

    $pedido = $pedidoModel
        ->select('pedidos.*, clientes.nombre AS cliente_nombre, clientes.telefono, clientes.direccion, clientes.localidad, usuarios.nombre AS vendedor_nombre')
        ->join('clientes', 'clientes.id = pedidos.cliente_id')
        ->join('usuarios', 'usuarios.id = pedidos.usuario_id')
        ->where('pedidos.id', $id)
        ->first();

    if (!$pedido) {
        return redirect()->to('/pedidos')->with('error', 'El pedido no existe.');
    }

    if (session('rol') === 'vendedor' && (int) $pedido['usuario_id'] !== (int) session('id_usuario')) {
        return redirect()->to('/pedidos')->with('error', 'No tienes permisos para ver este pedido.');
    }

    $detalles = $pedidoDetalleModel
        ->select('pedido_detalles.*, productos.nombre AS producto_nombre, productos.kilogramos, categorias.nombre AS categoria_nombre')
        ->join('productos', 'productos.id = pedido_detalles.producto_id')
        ->join('categorias', 'categorias.id = productos.categoria_id')
        ->where('pedido_detalles.pedido_id', $id)
        ->findAll();