app/Controllers/PrecioProductos.php

    private function obtenerPreciosFiltrados(PrecioProductoModel $precioProductoModel, string $buscar, string $molino, string $categoriaId): array
    {
        $builder = $precioProductoModel
            ->select('precio_productos.*, productos.nombre AS producto_nombre, productos.kilogramos, productos.molino, categorias.nombre AS categoria_nombre, categorias.id AS categoria_id')
            ->join('productos', 'productos.id = precio_productos.producto_id')
            ->join('categorias', 'categorias.id = productos.categoria_id');

        if ($buscar !== '') {
            $builder->like('productos.nombre', $buscar);
        }

        if ($molino !== '') {
            $builder->where('productos.molino', $molino);
        }

        if ($categoriaId !== '') {
            $builder->where('productos.categoria_id', $categoriaId);
        }

        return $builder
            ->orderBy('productos.nombre', 'ASC')
            ->orderBy('precio_productos.cantidad_desde', 'ASC')
            ->findAll();
---
SELECT `precio_productos`.*, `productos`.`nombre` AS `producto_nombre`, `productos`.`kilogramos`, `productos`.`molino`, `categorias`.`nombre` AS `categoria_nombre`, `categorias`.`id` AS `categoria_id`
FROM `precio_productos`
JOIN `productos` ON `productos`.`id` = `precio_productos`.`producto_id`
JOIN `categorias` ON `categorias`.`id` = `productos`.`categoria_id`
ORDER BY `productos`.`nombre` ASC, `precio_productos`.`cantidad_desde` ASC