app/Controllers/Productos.php

    public function index()
    {
        $productoModel = new ProductoModel();

        $productos = $productoModel
            ->select('productos.*, categorias.nombre AS categoria_nombre')
            ->join('categorias', 'categorias.id = productos.categoria_id')
            ->orderBy('productos.id', 'DESC')
            ->findAll();
---
SELECT `productos`.*, `categorias`.`nombre` AS `categoria_nombre`
FROM `productos`
JOIN `categorias` ON `categorias`.`id` = `productos`.`categoria_id`
ORDER BY `productos`.`id` DESC

    public function edit($id = null)
    {
        if (session('rol') !== 'admin') {
            return redirect()->to('/productos')->with('error', 'No tenés permiso para editar productos.');
        }

        $productoModel = new ProductoModel();
        $categoriaModel = new CategoriaModel();

        $producto = $productoModel->find($id);

        if (!$producto) {
            return redirect()->to('/productos')->with('error', 'Producto no encontrado.');
        }

        $data = [
            'producto'   => $producto,
            'categorias' => $categoriaModel->orderBy('nombre', 'ASC')->findAll(),
---
SELECT *
FROM `productos`
WHERE `productos`.`id` = '37'
SELECT *
FROM `categorias`
ORDER BY `nombre` ASC