app/Views/dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `productos`
WHERE `stock_unidades` <= stock_minimo
AND `stock_unidades` > 0
SELECT COUNT(*) AS `numrows`
FROM `productos`
WHERE `stock_unidades` <= 0
---
<?php
$db = \Config\Database::connect();

$productosStockBajo = $db->table('productos')
    ->where('stock_unidades <= stock_minimo')
    ->where('stock_unidades >', 0)
    ->countAllResults();

$productosSinStock = $db->table('productos')
    ->where('stock_unidades <=', 0)
    ->countAllResults();